# HorizontalAlignment Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNoteOptions..::..HorizontalAlignment Property
TextNoteOptions Class See Also
---
Horizontal alignment of the text.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public HorizontalTextAlignment HorizontalAlignment { get; set; }
```

Visual Basic
---
```text
Public Property HorizontalAlignment As HorizontalTextAlignment
	Get
	Set
```

Visual C++
---
```text
public:
property HorizontalTextAlignment HorizontalAlignment {
	HorizontalTextAlignment get ();
	void set (HorizontalTextAlignment value);
}
```

# Remarks
Default is Left alignment.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
TextNoteOptions Class
Autodesk.Revit.DB Namespace